<template>
  <dv-scroll-board
    :config="config"
    style="width: 90%; height: 95%; margin-left: 20px"
  />
</template>
        
        <script>
export default {
  data() {
    return {
      config: {
        header: ["道路名称", "施工时段", "截至期限", "施工范围"],
        data: [
          [
            "2021年浮石大桥结构定期检测(含桩基专项检测)项目",
            "2022年1月7日至2022年1月14日",
            "2022年1月14日",
            "书院大桥-衢州花园小区红绿灯路口",
          ],
          [
            "31011工程长输油管线工程",
            "2022年1月1日至2022年8月31日",
            "2022年1月14日",
            "S305省道塔太线",
          ],
          [
            "柯城区双西港园区基础设施提升改造项目-柯城区曙光路改造工程",
            "2022年2月16日至2022年8月26日",
            "2022年1月14日",
            "曙光路",
          ],
          [
            "城南危化品处理中心停车场出入口交通改造（硬路肩加宽）",
            "2022年2月8日至2022年4月18日",
            "2022年1月14日",
            "城南危化品处理中心停车场出入口",
          ],
          [
            "衢江大桥东片区道路优化提升项目",
            "2022年2月16日至2022年6月30日劳",
            "2022年1月14日",
            "通荷路、新元路、",
          ],
          [
            "衢州市城市综合管理服务平台（一期)采购项目",
            "2022年2月26日至2022年3月23日",
            "2022年1月14日",
            "讲舍街天桥、浮石大桥、水亭门隧道",
          ],
          [
            "柯城区2022年农村公路桥梁维修加固工程(柯山一号桥)",
            "2022年3月1日至2022年5月31日",
            "2022年1月14日",
            "(K8+620-K8+730)",
          ],
          [
            "衢江区2022年国道省道改建工程",
            "2022年3月30日至2022年6月29日",
            "2022年1月14日",
            "衢江界头至塔底段",
          ],
          [
            "工程施工",
            "2022年4月8日至2022年7月20日",
            "2022年1月14日",
            "九曲巷、巨化路-劳动路",
          ],
          [
            "石二线封闭施工",
            "2022年1月24日至2022年4月30日",
            "2022年1月14日",
            "北起新石二线该路起点",
          ],
          [
            "衢州智慧新城百家坊社区项目",
            "2022年4月6日至?",
            "2022年1月14日",
            "双江线(智慧大道至320国道)",
          ],
          [
            "人行道改造、电力排管施工",
            "2022年5月10日至2022年7月10日",
            "2022年1月14日",
            "礼贤未来社区城市供电配套排管工程",
          ],
          [
            "衢州绿城志城-凤栖云庐项目",
            "2022年8月3日至2022年8月13日",
            "2022年1月14日",
            "双岭中路",
          ],
          [
            "衢州市城南初中周边道路配套工程",
            "2022年1月",
            "2022年1月14日",
            "衢化西路",
          ],
          [
            "凯胜路道路改造工程",
            "2022年7月18日至2022年8月31日",
            "2022年1月14日",
            "凯胜路",
          ],
          [
            "351国道(柯城区段)非现场治超工程",
            "2022年9月5日至2022年9月25日",
            "2022年1月14日",
            "351国道K51+700处，K62+800处",
          ],
        ],
        rowNum: "6",
        columnWidth: [120],
        align: ["left"],
        waitTime: "3000",
        // carousel: "page",
        // oddRowBGC: "rgba(0, 67, 197,.5)",
        // evenRowBGC: "rgba(81, 166, 255,.5)",
        // headerBGC: "transparent",
        oddRowBGC: "transparent",
        evenRowBGC: " transparent",
        headerBGC: " transparent",
      },
    };
  },
};
</script>
        <style lang="scss" scoped>
</style>
        
  
